# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv9s object detection model. For Usage examples see https://docs.ultralytics.com/models/yolov9
# 917 layers, 7318368 parameters, 27.6 GFLOPs

# Parameters
nc: 80 # number of classes

# GELAN backbone
backbone:
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [64, 1, 1]]
  - [-1, 1, D3, [2, 2, 3]] # 2-P2/4
  - [-1, 1, ELAN1, [64, 64, 32]] # 3
  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, D3, [2, 2, 3]] # 5-P2/4
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]] # 6
  - [-1, 1, Conv, [192, 1, 1]]
  - [-1, 1, D3, [2, 2, 3]] # 8-P2/4
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]] # 9
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, D3, [2, 2, 3]] # 11-P2/4
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]] # 12
  - [-1, 1, SPPELAN, [256, 128]] # 13

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]] # 19

  - [-1, 1, D3, [2, 2, 3]]
  - [-1, 1, Conv, [96, 1, 1]]
  - [[-1, 16], 1, Concat, [1]] # cat head P4
  - [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]] # 23 (P4/16-medium)

  - [-1, 1, D3, [2, 2, 3]]
  - [-1, 1, Conv, [128, 1, 1]]
  - [[-1, 13], 1, Concat, [1]] # cat head P5
  - [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]] # 27 (P5/32-large)

  - [[19, 23, 27], 1, Detect, [nc]] # Detect(P3, P4 P5)
