# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv9t object detection model. For Usage examples see https://docs.ultralytics.com/models/yolov9
# 917 layers, 2128720 parameters, 8.5 GFLOPs

# Parameters
nc: 16 # number of classes

# GELAN backbone
backbone:
  - [-1, 1, Conv, [16, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [32, 1, 1]]
  - [-1, 1, D3, [2, 2, 3]] # 2-P2/4
  - [-1, 1, ELAN1, [32, 32, 16]] # 3
  - [-1, 1, Conv, [64, 1, 1]]
  - [-1, 1, D3, [2, 2, 3]] # 5-P3/8
  - [-1, 1, RepNCSPELAN4, [64, 64, 32, 3]] # 6
  - [-1, 1, Conv, [96, 1, 1]]
  - [-1, 1, D3, [2, 2, 3]] # 8-P4/16
  - [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]] # 9
  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, D3, [2, 2, 3]] # 11-P5/32
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]] # 12
  - [-1, 1, SPPELAN, [128, 64]] # 13

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 9], 1, Concat, [1]] # cat backbone P4
  - [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]] # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3
  - [-1, 1, RepNCSPELAN4, [64, 64, 32, 3]] # 19

  - [-1, 1, D3, [2, 2, 3]]
  - [-1, 1, Conv, [48, 1, 1]]
  - [[-1, 16], 1, Concat, [1]] # cat head P4
  - [-1, 1, RepNCSPELAN4, [96, 96, 48, 3]] # 23 (P4/16-medium)

  - [-1, 1, D3, [2, 2, 3]]
  - [-1, 1, Conv, [64, 1, 1]]
  - [[-1, 13], 1, Concat, [1]] # cat head P5
  - [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]] # 27 (P5/32-large)

  - [[19, 23, 27], 1, v8Detect, [nc]] # Detect(P3, P4, P5)
